Tekla.Structures.DialogInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.DialogInternal.DelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.DialogInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.DialogInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: